app/controllers/api/devices_controller.rb

INSERT INTO "devices" ("phone_number", "carrier", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["phone_number", "\"2628940630\""], ["carrier", "\"dsfdfsdfsdfs\""], ["created_at", "2021-02-27 19:34:26.527173"], ["updated_at", "2021-02-27 19:34:26.527173"]]
---
  def register
    if Phonelib.valid?(params["phone_number"])
      device = Device.create(phone_number: params["phone_number"], carrier: params["carrier"])

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "heartbeats" ("device_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["device_id", 1], ["created_at", "2021-02-27 19:36:46.968286"], ["updated_at", "2021-02-27 19:36:46.968286"]]
---
  def alive
    device = Device.find_by_id(params["device_id"])
    if device.present?
      if device.disabled_at == nil
        heartbeat = Heartbeat.create!(device_id: device.id)

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reports" ("device_id", "sender", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["device_id", 1], ["sender", "Hamza"], ["message", "Sample Msg"], ["created_at", "2021-02-26 11:08:07.019015"], ["updated_at", "2021-02-26 11:08:07.019015"]]
---
  def report
    device = Device.find_by_id(params["device_id"])
    if device.present?
      report = Report.create(device_id: device.id, message: params["message"], sender: params["sender"])

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "devices" SET "disabled_at" = $1, "updated_at" = $2 WHERE "devices"."id" = $3  [["disabled_at", "2021-02-27 19:38:18.787815"], ["updated_at", "2021-02-27 19:38:18.788668"], ["id", 1]]
---
  def terminate
    device = Device.find_by_id(params["device_id"])
    if device.present?
      device = device.update(disabled_at: Time.now)